app/controllers/strategies_controller.rb

SELECT * FROM "strategies"
---
  def index
    @strategies = Strategy.all

SELECT * FROM "strategies" WHERE ("strategies"."id" = 1)
---
  def show
    @strategy = Strategy.find(params[:id])

INSERT INTO "strategies" ("updated_at", "created_at", "name") VALUES('2012-10-06 23:43:22.047069', '2012-10-06 23:43:22.047069', 'herpderptest') RETURNING "id"
---
  def create
    @strategy = Strategy.new(params[:strategy])

    respond_to do |format|
      if @strategy.save