app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    if @user.save
---
INSERT INTO "users" ("username", "email", "persistence_token", "created_at", "crypted_password", "password_salt", "updated_at") VALUES('birk5437', 'birk5437@gmail.com', '22f1ba01c1929ed149bcb750c9082a3c268e59805c4dea9cca86d88bf714dfae54c65be28d371f9cef97d72dae85c4818aec123b4cbf7680c068d86d6098326e', '2012-10-09 23:59:23.165334', '5b07faff65abf01af4f5fb3153c8443855bc141f0420617fb791577983d7339fcfa6d92d04a64ed33d2ad983c278f28ba15a9df5df3d62ed5b77c000003e8beb', 'THWDZmtgD7Uz5dIaQ0h', '2012-10-09 23:59:23.165334') RETURNING "id"